{"config": [{"config": {"name": "embedding_1", "batch_input_shape": [null, 70], "output_dim": 300, "dtype": "float32", "embeddings_constraint": null, "activity_regularizer": null, "mask_zero": false, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "input_dim": 33302, "input_length": 70, "trainable": true, "embeddings_regularizer": null}, "class_name": "Embedding"}, {"config": {"trainable": true, "layer": {"config": {"stateful": false, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "name": "lstm_1", "return_sequences": true, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "recurrent_constraint": null, "unroll": false, "implementation": 1, "bias_regularizer": null, "unit_forget_bias": true, "return_state": false, "recurrent_dropout": 0.6, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "activation": "tanh", "units": 150, "kernel_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "trainable": true, "dropout": 0.3}, "class_name": "LSTM"}, "name": "bidirectional_1", "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"trainable": true, "layer": {"config": {"stateful": false, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "name": "lstm_2", "return_sequences": true, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "recurrent_constraint": null, "unroll": false, "implementation": 1, "bias_regularizer": null, "unit_forget_bias": true, "return_state": false, "recurrent_dropout": 0.5, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "activation": "tanh", "units": 60, "kernel_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "trainable": true, "dropout": 0.2}, "class_name": "LSTM"}, "name": "bidirectional_2", "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"trainable": true, "layer": {"config": {"name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activation": "softmax", "units": 9, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null}, "class_name": "Dense"}, "name": "time_distributed_1"}, "class_name": "TimeDistributed"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.0"}