{"config": [{"config": {"embeddings_regularizer": null, "activity_regularizer": null, "input_dim": 33302, "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "dtype": "float32", "mask_zero": false, "name": "embedding_1", "batch_input_shape": [null, 70], "input_length": 70, "trainable": true, "output_dim": 300, "embeddings_constraint": null}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "bidirectional_1", "layer": {"config": {"unroll": false, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.6, "activation": "tanh", "name": "lstm_1", "dropout": 0.3, "units": 150, "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "go_backwards": false, "stateful": false, "return_sequences": true, "use_bias": true, "implementation": 1, "activity_regularizer": null, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "return_state": false, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "kernel_regularizer": null, "recurrent_constraint": null}, "class_name": "LSTM"}, "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"trainable": true, "name": "bidirectional_2", "layer": {"config": {"unroll": false, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.5, "activation": "tanh", "name": "lstm_2", "dropout": 0.2, "units": 60, "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "go_backwards": false, "stateful": false, "return_sequences": true, "use_bias": true, "implementation": 1, "activity_regularizer": null, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "return_state": false, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "kernel_regularizer": null, "recurrent_constraint": null}, "class_name": "LSTM"}, "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"trainable": true, "name": "time_distributed_1", "layer": {"config": {"use_bias": true, "activity_regularizer": null, "activation": "softmax", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "dense_1", "units": 9, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}}, "class_name": "TimeDistributed"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.0"}